export const translate = {
    entity: {
        user: {
            i: "пользователь",
            r: "пользователя",
            d: "пользователю",
            v: "пользователя",
            t: "пользователем",
            p: "о пользователе",
        },
        locale: {
            i: "локализация",
            r: "локализации",
            d: "локализации",
            v: "локализацию",
            t: "локализацией",
            p: "о локализации",
        },
        platform: {
            i: "платформа",
            r: "платформы",
            d: "платформе",
            v: "платформу",
            t: "платформой",
            p: "о платформе",
        },
        company: {
            i: "компания",
            r: "компании",
            d: "компании",
            v: "компанию",
            t: "компанией",
            p: "о компании",
        },
        genre: {
            i: "жанр",
            r: "жанра",
            d: "жанре",
            v: "жанр",
            t: "жанром",
            p: "о жанре",
        },
        game: {
            i: "игра",
            r: "игры",
            d: "игре",
            v: "игру",
            t: "игрой",
            p: "об игре",
        },
        series: {
            i: "серия",
            r: "серии",
            d: "серии",
            v: "серию",
            t: "серией",
            p: "о серии",
        },
    },
    field: {
        id: {
            i: "id"
        },
        name: {
            i: "Название"
        },
        release_date: {
            i: "Дата релиза"
        },
        description: {
            i: "Описание"
        },
        logo: {
            i: "Логотип"
        },
        age_rating: {
            i: "Возрастной рейтинг"
        },
        series: {
            i: "Серия"
        },
        rating: {
            i: "Рейтинг"
        },
        genres: {
            i: "Жанры"
        },
        developers: {
            i: "Разработчики"
        },
        distributors: {
            i: "Издатели"
        },
        locales: {
            i: "Локализации"
        },
        platforms: {
            i: "Платформы"
        },
        country: {
            i: "Страна"
        },
        language: {
            i: "Язык"
        },
        series_id: {
            i: "Серия"
        },
        genres_ids: {
            i: "Жанры"
        },
        developers_ids: {
            i: "Разработчики"
        },
        distributors_ids: {
            i: "Издатели"
        },
        locales_ids: {
            i: "Локализации"
        },
        platforms_ids: {
            i: "Платформы"
        },
        password: {
            i: "Пароль"
        },
        username: {
            i: "Логин или Email"
        },
        login: {
            i: "Логин"
        },
        new_password: {
            i: "Пароль"
        },
        confirm_password: {
            i: "Подтвердите пароль"
        },
        birth_date: {
            i: "Дата рождения"
        },
        email: {
            i: "Email"
        },
        text: {
            i: "Текст"
        },
        avatar: {
            i: "Фото профиля"
        },
        update_reason: {
            i: "Причина изменения"
        }
    }
}